
# State **`s3://infrahouse-github-control-state/terraform.tfstate`**
## Affected resources counts

|  Success  |  Add   |  Change   |  Destroy   |
|:---------:|:-------|:----------|:-----------|
|     ✅     | ❔      | ❔         | ❔          |
## Affected resources by action

No affected resources
<details>
<summary>STDOUT</summary>

```
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform planned the following actions, but then encountered a problem:

  # github_organization_settings.infrahouse will be updated in-place
  ~ resource "github_organization_settings" "infrahouse" {
      + billing_email                                                = "billing@infrahouse.com"
      + default_repository_permission                                = "read"
        id                                                           = "121984263"
        name                                                         = "InfraHouse"
        # (22 unchanged attributes hidden)
    }

  # module.ih8_tf_template.github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
      ~ allow_merge_commit          = false -> true
      ~ allow_rebase_merge          = false -> true
      ~ allow_squash_merge          = false -> true
        id                          = "terraform-template"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
        name                        = "terraform-template"
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
        # (25 unchanged attributes hidden)
    }

  # module.ih_8_repos["github-control"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-03-20 14:48:39 +0000 UTC" -> (known after apply)
      ~ id              = "github-control:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-03-20 14:48:39 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.ih_8_repos["github-control"].github_branch_protection.main will be created
  + resource "github_branch_protection" "main" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "R_kgDOI2vu7A"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = false

      + required_pull_request_reviews {
          + require_last_push_approval      = false
          + required_approving_review_count = 0
        }

      + required_status_checks {
          + contexts = [
              + "Terraform Plan",
            ]
          + strict   = true
        }
    }

  # module.ih_8_repos["github-control"].github_repository.repo will be updated in-place
  ~ resource "github_repository" "repo" {
        id                          = "github-control"
        name                        = "github-control"
      ~ vulnerability_alerts        = false -> true
        # (33 unchanged attributes hidden)
    }

  # module.repos["aws-control"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-06-30 23:39:23 +0000 UTC" -> (known after apply)
      ~ id              = "aws-control:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-06-30 23:39:23 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.repos["aws-control-289256138624"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-06-30 23:39:27 +0000 UTC" -> (known after apply)
      ~ id              = "aws-control-289256138624:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-06-30 23:39:27 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.repos["aws-control-303467602807"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-06-30 23:39:28 +0000 UTC" -> (known after apply)
      ~ id              = "aws-control-303467602807:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-06-30 23:39:28 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.repos["aws-control-493370826424"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-07-09 16:11:13 +0000 UTC" -> (known after apply)
      ~ id              = "aws-control-493370826424:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-07-09 16:11:13 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.repos["cookiecutter-github-control"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-03-22 03:03:10 +0000 UTC" -> (known after apply)
      ~ id              = "cookiecutter-github-control:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-03-22 03:03:10 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.repos["infrahouse-com"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-08-19 20:36:21 +0000 UTC" -> (known after apply)
      ~ id              = "infrahouse-com:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-08-19 20:36:21 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.repos["infrahouse-puppet-data"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-11-08 13:02:45 +0000 UTC" -> (known after apply)
      ~ id              = "infrahouse-puppet-data:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-11-08 13:02:45 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.repos["infrahouse-toolkit"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-03-22 03:03:01 +0000 UTC" -> (known after apply)
      ~ id              = "infrahouse-toolkit:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-03-22 03:03:01 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.repos["infrahouse-website-infra"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-03-22 03:03:02 +0000 UTC" -> (known after apply)
      ~ id              = "infrahouse-website-infra:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-03-22 03:03:02 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.repos["proxysql-sandbox"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-06-15 14:57:57 +0000 UTC" -> (known after apply)
      ~ id              = "proxysql-sandbox:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-06-15 14:57:57 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.repos["puppet-code"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-08-03 15:39:14 +0000 UTC" -> (known after apply)
      ~ id              = "puppet-code:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-08-03 15:39:14 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-ci-cd"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-10-18 00:29:33 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-ci-cd:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-10-18 00:29:33 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-cloud-init"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-08-18 15:43:43 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-cloud-init:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-08-18 15:43:43 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-debian-repo"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-07-24 23:33:38 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-debian-repo:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-07-24 23:33:38 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-ecs"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-11-23 16:01:51 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-ecs:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-11-23 16:01:51 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-elasticsearch"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2024-02-05 17:31:01 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-elasticsearch:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2024-02-05 17:31:01 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-gh-identity-provider"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-07-03 23:05:00 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-gh-identity-provider:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-07-03 23:05:00 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-gha-admin"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-07-02 15:15:28 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-gha-admin:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-07-02 15:15:28 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-github-role"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-11-07 23:09:44 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-github-role:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-11-07 23:09:44 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-instance-profile"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-08-10 15:10:07 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-instance-profile:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-08-10 15:10:07 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-jumphost"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-11-01 16:16:00 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-jumphost:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-11-01 16:16:00 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-kibana"].github_actions_secret.secret["GH_TOKEN"] will be destroyed
  # (because module.repos["terraform-aws-kibana"] is not in configuration)
  - resource "github_actions_secret" "secret" {
      - created_at      = "2024-02-18 02:11:56 +0000 UTC" -> null
      - id              = "terraform-aws-kibana:GH_TOKEN" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "terraform-aws-kibana" -> null
      - secret_name     = "GH_TOKEN" -> null
      - updated_at      = "2024-02-18 02:11:56 +0000 UTC" -> null
    }

  # module.repos["terraform-aws-kibana"].github_repository.repo will be destroyed
  # (because module.repos["terraform-aws-kibana"] is not in configuration)
  - resource "github_repository" "repo" {
      - allow_auto_merge            = false -> null
      - allow_merge_commit          = true -> null
      - allow_rebase_merge          = true -> null
      - allow_squash_merge          = true -> null
      - allow_update_branch         = false -> null
      - archived                    = false -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = false -> null
      - description                 = "Module that deploys Kibana" -> null
      - etag                        = "W/\"65d7db5449f20f4037b8dfee952ed823f4942152e4c803789c27aeb0a1dde82a\"" -> null
      - full_name                   = "infrahouse/terraform-aws-kibana" -> null
      - git_clone_url               = "git://github.com/infrahouse/terraform-aws-kibana.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = true -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/infrahouse/terraform-aws-kibana" -> null
      - http_clone_url              = "https://github.com/infrahouse/terraform-aws-kibana.git" -> null
      - id                          = "terraform-aws-kibana" -> null
      - is_template                 = false -> null
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
      - name                        = "terraform-aws-kibana" -> null
      - node_id                     = "R_kgDOLUDwIQ" -> null
      - primary_language            = "HCL" -> null
      - private                     = false -> null
      - repo_id                     = 759230497 -> null
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url               = "git@github.com:infrahouse/terraform-aws-kibana.git" -> null
      - svn_url                     = "https://github.com/infrahouse/terraform-aws-kibana" -> null
      - topics                      = [] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = false -> null
    }

  # module.repos["terraform-aws-kibana"].github_team_repository.dev will be destroyed
  # (because module.repos["terraform-aws-kibana"] is not in configuration)
  - resource "github_team_repository" "dev" {
      - etag       = "W/\"fc56a102e9abf38a27f4da924ea2c550054a653de5ae9dbc3e075ab9ba223db6\"" -> null
      - id         = "7332815:terraform-aws-kibana" -> null
      - permission = "push" -> null
      - repository = "terraform-aws-kibana" -> null
      - team_id    = "7332815" -> null
    }

  # module.repos["terraform-aws-pypiserver"].github_actions_secret.secret["GH_TOKEN"] will be destroyed
  # (because module.repos["terraform-aws-pypiserver"] is not in configuration)
  - resource "github_actions_secret" "secret" {
      - created_at      = "2024-02-20 20:53:05 +0000 UTC" -> null
      - id              = "terraform-aws-pypiserver:GH_TOKEN" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "terraform-aws-pypiserver" -> null
      - secret_name     = "GH_TOKEN" -> null
      - updated_at      = "2024-02-20 20:53:05 +0000 UTC" -> null
    }

  # module.repos["terraform-aws-pypiserver"].github_repository.repo will be destroyed
  # (because module.repos["terraform-aws-pypiserver"] is not in configuration)
  - resource "github_repository" "repo" {
      - allow_auto_merge            = false -> null
      - allow_merge_commit          = true -> null
      - allow_rebase_merge          = true -> null
      - allow_squash_merge          = true -> null
      - allow_update_branch         = false -> null
      - archived                    = false -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = false -> null
      - description                 = "Terraform module that deploys a private PyPI server." -> null
      - etag                        = "W/\"9c2e453ca996b48c81deafa605b559d3a1f18a361ca5a1f6b686c991d1c7b4d2\"" -> null
      - full_name                   = "infrahouse/terraform-aws-pypiserver" -> null
      - git_clone_url               = "git://github.com/infrahouse/terraform-aws-pypiserver.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = true -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/infrahouse/terraform-aws-pypiserver" -> null
      - http_clone_url              = "https://github.com/infrahouse/terraform-aws-pypiserver.git" -> null
      - id                          = "terraform-aws-pypiserver" -> null
      - is_template                 = false -> null
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
      - name                        = "terraform-aws-pypiserver" -> null
      - node_id                     = "R_kgDOLVojaQ" -> null
      - primary_language            = "HCL" -> null
      - private                     = false -> null
      - repo_id                     = 760882025 -> null
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url               = "git@github.com:infrahouse/terraform-aws-pypiserver.git" -> null
      - svn_url                     = "https://github.com/infrahouse/terraform-aws-pypiserver" -> null
      - topics                      = [] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = false -> null
    }

  # module.repos["terraform-aws-pypiserver"].github_team_repository.dev will be destroyed
  # (because module.repos["terraform-aws-pypiserver"] is not in configuration)
  - resource "github_team_repository" "dev" {
      - etag       = "W/\"a539dea8ea703d240bfddcbaf495bc2c8157d71724fd750eb276d0dd994adf21\"" -> null
      - id         = "7332815:terraform-aws-pypiserver" -> null
      - permission = "push" -> null
      - repository = "terraform-aws-pypiserver" -> null
      - team_id    = "7332815" -> null
    }

  # module.repos["terraform-aws-service-network"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-06-18 03:57:27 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-service-network:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-06-18 03:57:27 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-state-bucket"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-10-15 14:59:48 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-state-bucket:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-10-15 14:59:48 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-state-manager"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-10-09 22:25:46 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-state-manager:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-10-09 22:25:46 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.repos["terraform-aws-update-dns"].github_actions_secret.secret["GH_TOKEN"] will be destroyed
  # (because module.repos["terraform-aws-update-dns"] is not in configuration)
  - resource "github_actions_secret" "secret" {
      - created_at      = "2024-02-12 22:51:30 +0000 UTC" -> null
      - id              = "terraform-aws-update-dns:GH_TOKEN" -> null
      - plaintext_value = (sensitive value) -> null
      - repository      = "terraform-aws-update-dns" -> null
      - secret_name     = "GH_TOKEN" -> null
      - updated_at      = "2024-02-12 22:51:30 +0000 UTC" -> null
    }

  # module.repos["terraform-aws-update-dns"].github_repository.repo will be destroyed
  # (because module.repos["terraform-aws-update-dns"] is not in configuration)
  - resource "github_repository" "repo" {
      - allow_auto_merge            = false -> null
      - allow_merge_commit          = true -> null
      - allow_rebase_merge          = true -> null
      - allow_squash_merge          = true -> null
      - allow_update_branch         = false -> null
      - archived                    = false -> null
      - default_branch              = "main" -> null
      - delete_branch_on_merge      = false -> null
      - description                 = "Module creates a lambda that manages DNS A records for instances in an autoscaling group." -> null
      - etag                        = "W/\"703790c0e9e5d3a2bc0c1d494e96d597cbb58cd1f72fd3e3f36f99c1a27bbba5\"" -> null
      - full_name                   = "infrahouse/terraform-aws-update-dns" -> null
      - git_clone_url               = "git://github.com/infrahouse/terraform-aws-update-dns.git" -> null
      - has_discussions             = false -> null
      - has_downloads               = false -> null
      - has_issues                  = true -> null
      - has_projects                = false -> null
      - has_wiki                    = false -> null
      - html_url                    = "https://github.com/infrahouse/terraform-aws-update-dns" -> null
      - http_clone_url              = "https://github.com/infrahouse/terraform-aws-update-dns.git" -> null
      - id                          = "terraform-aws-update-dns" -> null
      - is_template                 = false -> null
      - merge_commit_message        = "PR_TITLE" -> null
      - merge_commit_title          = "MERGE_MESSAGE" -> null
      - name                        = "terraform-aws-update-dns" -> null
      - node_id                     = "R_kgDOLRisTA" -> null
      - primary_language            = "Python" -> null
      - private                     = false -> null
      - repo_id                     = 756591692 -> null
      - squash_merge_commit_message = "COMMIT_MESSAGES" -> null
      - squash_merge_commit_title   = "COMMIT_OR_PR_TITLE" -> null
      - ssh_clone_url               = "git@github.com:infrahouse/terraform-aws-update-dns.git" -> null
      - svn_url                     = "https://github.com/infrahouse/terraform-aws-update-dns" -> null
      - topics                      = [] -> null
      - visibility                  = "public" -> null
      - vulnerability_alerts        = false -> null
    }

  # module.repos["terraform-aws-update-dns"].github_team_repository.dev will be destroyed
  # (because module.repos["terraform-aws-update-dns"] is not in configuration)
  - resource "github_team_repository" "dev" {
      - etag       = "W/\"cff84a3f5f4e7b7abc80bb7a50ca899725477400631e29cecf01a7775dc3a1f1\"" -> null
      - id         = "7332815:terraform-aws-update-dns" -> null
      - permission = "push" -> null
      - repository = "terraform-aws-update-dns" -> null
      - team_id    = "7332815" -> null
    }

  # module.repos["terraform-aws-website-pod"].github_actions_secret.secret["GH_TOKEN"] must be replaced
-/+ resource "github_actions_secret" "secret" {
      ~ created_at      = "2023-08-13 19:44:21 +0000 UTC" -> (known after apply)
      ~ id              = "terraform-aws-website-pod:GH_TOKEN" -> (known after apply)
      ~ plaintext_value = (sensitive value) # forces replacement
      ~ updated_at      = "2023-08-13 19:44:21 +0000 UTC" -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.infrahouse8-github-control.module.gha-admin.aws_iam_policy.github-assume-all will be created
  + resource "aws_iam_policy" "github-assume-all" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "ih-tf-github-control-github-assume-all"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "sts:AssumeRole"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "created_by_module" = "infrahouse/gha-admin/aws"
        }
      + tags_all    = {
          + "created_by"        = "infrahouse8/github-control"
          + "created_by_module" = "infrahouse/gha-admin/aws"
        }
    }

Plan: 28 to add, 3 to change, 35 to destroy.
```
</details>
<details>
<summary>STDERR</summary>

```
Error: GET https://api.github.com/repos/infrahouse8/github-control/invitations?per_page=100: 403 Must have admin rights to Repository. []

  with module.ih_8_repos["github-control"].github_repository_collaborator.collaborators["akuzminsky"],
  on modules/local-repo/repos.tf line 47, in resource "github_repository_collaborator" "collaborators":
  47: resource "github_repository_collaborator" "collaborators" {

```
</details>
<details><summary><i>metadata</i></summary>

```
eyJzMzovL2luZnJhaG91c2UtZ2l0aHViLWNvbnRyb2wtc3RhdGUvdGVycmFmb3JtLnRmc3RhdGUiOiB7InN1Y2Nlc3MiOiB0cnVlLCAic3Rkb3V0IjogIiIsICJzdGRlcnIiOiAiIiwgImFkZCI6IG51bGwsICJjaGFuZ2UiOiBudWxsLCAiZGVzdHJveSI6IG51bGx9fQ==
```
</details>